app/Controllers/AchatController.php

    public function index()
    {
        if (!session()->get('caisse')) return redirect()->to('/caisse');

        $caisse = session()->get('caisse');
        $produits = (new ProduitModel())->findAll();
        $achats = (new AchatModel())
        ->where('caisse_id', $caisse['id'])
        ->where('statut', 'en_cours')
        ->findAll();
---
SELECT *
FROM `produit`
SELECT *
FROM `achat`
WHERE `caisse_id` = 4
AND `statut` = 'en_cours'