app/Controllers/CaisseController.php

    public function choisir()
    {
        if (!session()->get('user')) return redirect()->to('/');
        $model = new CaisseModel();
        $caisses = $model->findAll();
---
SELECT *
FROM `caisse`

    public function valider()
    {
        $id = $this->request->getPost('caisse_id');
        $model = new CaisseModel();
        $caisse = $model->find($id);
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '4'