app/Controllers/HistoriqueController.php

SELECT `a`.*, `p`.`designation`, `p`.`prix` as `prix_actuel`, `c`.`numero` as `caisse_numero`, `a`.`created_at`
FROM `achat` `a`
JOIN `produit` `p` ON `p`.`id` = `a`.`produit_id`
JOIN `caisse` `c` ON `c`.`id` = `a`.`caisse_id`
WHERE `a`.`statut` = 'termine'
ORDER BY `a`.`created_at` DESC
---
    public function index()
    {
        if (!session()->get('user')) return redirect()->to('/');

        $db = \Config\Database::connect();

        // Récupérer tous les achats terminés avec le nom du produit et la caisse
        $achats = $db->table('achat a')
            ->select('a.*, p.designation, p.prix as prix_actuel, c.numero as caisse_numero, a.created_at')
            ->join('produit p', 'p.id = a.produit_id')
            ->join('caisse c',  'c.id = a.caisse_id')
            ->where('a.statut', 'termine')
            ->orderBy('a.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `caisse`
---
        ];

        // Solde par caisse
        $caisses = (new CaisseModel())->findAll();